In [27]:
import pandas as pd
import numpy as np

In [2]:
l=[10,20,30,40]

In [5]:
pd.Series(l)

0    10
1    20
2    30
3    40
dtype: int64

In [6]:
pd.Series(l, index=['i','ii','iii','iv'])

i      10
ii     20
iii    30
iv     40
dtype: int64

In [15]:
pd.DataFrame(l)

    0
0  10
1  20
2  30
3  40

In [20]:
d = {'Name':["raksha","chauhan","ritika"], "percentage":[1,2,3]}

In [21]:
pd.DataFrame(d)

      Name  percentage
0   raksha           1
1  chauhan           2
2   ritika           3

In [25]:
s = pd.Series()

C:\Users\Hp\AppData\Local\Temp\ipykernel_18700\3969311894.py:1: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  s = pd.Series()

In [45]:
import numpy as np
l = np.array([10,20,30,40])
print(l)

[10 20 30 40]

In [44]:
d = {'a':10,'b':20,'c':30}

In [51]:
pd.Series(d)

Name          [raksha, chauhan, ritika]
percentage                    [1, 2, 3]
dtype: object

In [58]:
df=pd.read_excel("C:\\Users\\Hp\\Desktop\\result.xlsx")
print(df)

   sr no  roll no  ep  ope  daa  total
0      1      101  60   34   23    117
1      2      102  67   45   45    157
2      3      103  70   67   67    204
3      4      104  89   87   89    265
4      5      105  78   90   98    266

In [62]:
s.index(l)

TypeError: 'RangeIndex' object is not callable

In [63]:
S1+S2

NameError: name 'S1' is not defined

In [64]:
df.head()

   sr no  roll no  ep  ope  daa  total
0      1      101  60   34   23    117
1      2      102  67   45   45    157
2      3      103  70   67   67    204
3      4      104  89   87   89    265
4      5      105  78   90   98    266

In [65]:
df.head(3)

   sr no  roll no  ep  ope  daa  total
0      1      101  60   34   23    117
1      2      102  67   45   45    157
2      3      103  70   67   67    204

In [66]:
df.tail()

   sr no  roll no  ep  ope  daa  total
0      1      101  60   34   23    117
1      2      102  67   45   45    157
2      3      103  70   67   67    204
3      4      104  89   87   89    265
4      5      105  78   90   98    266

In [67]:
df.tail(2)

   sr no  roll no  ep  ope  daa  total
3      4      104  89   87   89    265
4      5      105  78   90   98    266

In [69]:
df.describe()

          sr no     roll no        ep        ope        daa       total
count  5.000000    5.000000   5.00000   5.000000   5.000000    5.000000
mean   3.000000  103.000000  72.80000  64.600000  64.400000  201.800000
std    1.581139    1.581139  11.12205  24.865639  30.948344   65.800456
min    1.000000  101.000000  60.00000  34.000000  23.000000  117.000000
25%    2.000000  102.000000  67.00000  45.000000  45.000000  157.000000
50%    3.000000  103.000000  70.00000  67.000000  67.000000  204.000000
75%    4.000000  104.000000  78.00000  87.000000  89.000000  265.000000
max    5.000000  105.000000  89.00000  90.000000  98.000000  266.000000

In [74]:
df.columns

Index(['sr no', 'roll no', 'ep', 'ope', 'daa', 'total'], dtype='object')

In [72]:
df.columns

Index(['sr no', 'roll no', 'ep', 'ope', 'daa', 'total'], dtype='object')

In [73]:
df.shape

(5, 6)

In [78]:
df['roll no']

0    101
1    102
2    103
3    104
4    105
Name: roll no, dtype: int64

In [83]:
df[["roll no","ep"]]

   roll no  ep
0      101  60
1      102  67
2      103  70
3      104  89
4      105  78

In [84]:
df[1:5:1]

   sr no  roll no  ep  ope  daa  total
1      2      102  67   45   45    157
2      3      103  70   67   67    204
3      4      104  89   87   89    265
4      5      105  78   90   98    266

In [85]:
df[1:5:2]

   sr no  roll no  ep  ope  daa  total
1      2      102  67   45   45    157
3      4      104  89   87   89    265